In [6]:
import pandas as pd

unemp_county =  pd.read_csv("datasets/output.csv")
df = pd.read_csv("datasets/min_wage.csv",encoding="latin")
minwage = pd.DataFrame()

for name,group in df.groupby("State"):
    if minwage.empty:
        minwage = group.set_index("Year")[["Low.2018"]].rename(columns={"Low.2018":name})
    else:
        minwage = minwage.join(group.set_index("Year")[["Low.2018"]].rename(columns={"Low.2018":name}))

# test_pd = df.groupby("State")
# alabama_df = test_pd.get_group("Alabama")
# #alabama_df.drop("Footnote",axis=1,inplace=True)
# test_df = alabama_df.copy()
# test_df.drop("Footnote",axis=1,inplace=True)
# test_df.head()
minwage.head()

,Alabama,Alaska,Arizona,Arkansas,California,Colorado,Connecticut,Delaware,District of Columbia,Federal (FLSA),...,Tennessee,Texas,U.S. Virgin Islands,Utah,Vermont,Virginia,Washington,West Virginia,Wisconsin,Wyoming
Year,,,,,,,,,,,,,,,,,,,,,
1968,0.0,15.12,3.37,1.12,11.88,7.20,10.08,9.00,9.00,8.28,...,0.0,0.00,NaN,7.20,10.08,0.0,11.52,7.20,9.00,8.64
1969,0.0,14.33,3.19,1.07,11.26,6.83,9.56,8.53,8.53,7.85,...,0.0,0.00,NaN,6.83,9.56,0.0,10.92,6.83,8.53,8.19
1970,0.0,13.54,3.02,7.09,10.64,6.45,10.32,8.06,10.32,8.38,...,0.0,0.00,NaN,6.45,10.32,0.0,10.32,6.45,8.38,8.38
1971,0.0,12.99,2.89,6.80,10.20,6.18,9.89,7.73,9.89,8.04,...,0.0,0.00,NaN,6.18,9.89,0.0,9.89,6.18,8.04,8.04
1972,0.0,12.57,2.80,7.19,9.88,5.99,11.08,9.58,9.58,9.58,...,0.0,8.38,NaN,7.19,9.58,0.0,9.58,7.19,8.68,8.98

In [ ]:
#Impute missing data
import numpy as np

minwage = minwage.replace(0, np.NaN).dropna(axis=1)
minwage.head()
unemp_county.head()

In [3]:
def get_min_wage(year, state):
    try:
        return minwage.loc[year][state]
    except:
        return np.NaN

In [4]:
get_min_wage(2012,"Colorado")

8.33

In [10]:
unemp_county['min_wage'] = list(map(get_min_wage,unemp_county["Year"],unemp_county["State"]))

        Year     Month  State              County  Rate  min_wage
885543  2009  November  Maine     Somerset County  10.5      8.46
885544  2009  November  Maine       Oxford County  10.5      8.46
885545  2009  November  Maine         Knox County   7.5      8.46
885546  2009  November  Maine  Piscataquis County  11.3      8.46
885547  2009  November  Maine    Aroostook County   9.0      8.46

In [11]:
unemp_county.tail()

        Year     Month  State              County  Rate  min_wage
885543  2009  November  Maine     Somerset County  10.5      8.46
885544  2009  November  Maine       Oxford County  10.5      8.46
885545  2009  November  Maine         Knox County   7.5      8.46
885546  2009  November  Maine  Piscataquis County  11.3      8.46
885547  2009  November  Maine    Aroostook County   9.0      8.46

In [8]:
#Correlation and covariance
unemp_county[['Rate','min_wage']].corr()

              Rate  min_wage
Rate      1.000000 -0.084186
min_wage -0.084186  1.000000

In [9]:
unemp_county[['Rate','min_wage']].cov()

              Rate  min_wage
Rate      9.687873 -0.689465
min_wage -0.689465  6.923306

In [14]:
#Presidential Results
pres16 = pd.read_csv("datasets/pres16results.csv")
pres16.head(15)

,county,fips,cand,st,pct_report,votes,total_votes,pct,lead
0,NaN,US,Donald Trump,US,0.9951,60350241.0,127592176.0,0.472993,Donald Trump
1,NaN,US,Hillary Clinton,US,0.9951,60981118.0,127592176.0,0.477938,Donald Trump
2,NaN,US,Gary Johnson,US,0.9951,4164589.0,127592176.0,0.032640,Donald Trump
3,NaN,US,Jill Stein,US,0.9951,1255968.0,127592176.0,0.009844,Donald Trump
4,NaN,US,Evan McMullin,US,0.9951,451636.0,127592176.0,0.003540,Donald Trump
5,NaN,US,Darrell Castle,US,0.9951,180877.0,127592176.0,0.001418,Donald Trump
6,NaN,US,Gloria La Riva,US,0.9951,48308.0,127592176.0,0.000379,Donald Trump
7,NaN,US,Rocky De La Fuente,US,0.9951,32120.0,127592176.0,0.000252,Donald Trump
8,NaN,US,None of these candidates,US,0.9951,28824.0,127592176.0,0.000226,Donald Trump
9,NaN,US,Richard Duncan,US,0.9951,23501.0,127592176.0,0.000184,Donald Trump
10,NaN,US,Dan Vacek,US,0.9951,13546.0,127592176.0,0.000106,Donald Trump
11,NaN,US,Alyson Kennedy,US,0.9951,11456.0,127592176.0,0.000090,Donald Trump
12,NaN,US,Mike Smith,US,0.9951,8911.0,127592176.0,0.000070,Donald Trump
13,NaN,US,Chris Keniston,US,0.9951,6617.0,127592176.0,0.000052,Donald Trump
14,NaN,US,Lynn Kahn,US,0.9951,5565.0,127592176.0,0.000044,Donald Trump

In [15]:
top_candidates = pres16.head(10)['cand'].values
print(top_candidates)

['Donald Trump' 'Hillary Clinton' 'Gary Johnson' 'Jill Stein'
 'Evan McMullin' 'Darrell Castle' 'Gloria La Riva' 'Rocky De La Fuente'
 ' None of these candidates' 'Richard Duncan']

In [23]:
county_2015 = unemp_county[ (unemp_county['Year']==2015) & (unemp_county["Month"]=="February")]
county_2015.head()

   Year     Month        State         County  Rate  min_wage
0  2015  February  Mississippi  Newton County   6.1       0.0
1  2015  February  Mississippi  Panola County   9.4       0.0
2  2015  February  Mississippi  Monroe County   7.9       0.0
3  2015  February  Mississippi   Hinds County   6.1       0.0
4  2015  February  Mississippi  Kemper County  10.6       0.0

In [20]:
state_abbv = pd.read_csv("datasets/state_abbv.csv", index_col=0)
state_abbv.head()

               Postal Code
State/District
Alabama                 AL
Alaska                  AK
Arizona                 AZ
Arkansas                AR
California              CA

In [22]:
state_abbv_dict = state_abbv.to_dict()['Postal Code']

{'Alabama': 'AL',
 'Alaska': 'AK',
 'Arizona': 'AZ',
 'Arkansas': 'AR',
 'California': 'CA',
 'Colorado': 'CO',
 'Connecticut': 'CT',
 'Delaware': 'DE',
 'District of Columbia': 'DC',
 'Florida': 'FL',
 'Georgia': 'GA',
 'Hawaii': 'HI',
 'Idaho': 'ID',
 'Illinois': 'IL',
 'Indiana': 'IN',
 'Iowa': 'IA',
 'Kansas': 'KS',
 'Kentucky': 'KY',
 'Louisiana': 'LA',
 'Maine': 'ME',
 'Maryland': 'MD',
 'Massachusetts': 'MA',
 'Michigan': 'MI',
 'Minnesota': 'MN',
 'Mississippi': 'MS',
 'Missouri': 'MO',
 'Montana': 'MT',
 'Nebraska': 'NE',
 'Nevada': 'NV',
 'New Hampshire': 'NH',
 'New Jersey': 'NJ',
 'New Mexico': 'NM',
 'New York': 'NY',
 'North Carolina': 'NC',
 'North Dakota': 'ND',
 'Ohio': 'OH',
 'Oklahoma': 'OK',
 'Oregon': 'OR',
 'Pennsylvania': 'PA',
 'Rhode Island': 'RI',
 'South Carolina': 'SC',
 'South Dakota': 'SD',
 'Tennessee': 'TN',
 'Texas': 'TX',
 'Utah': 'UT',
 'Vermont': 'VT',
 'Virginia': 'VA',
 'Washington': 'WA',
 'West Virginia': 'WV',
 'Wisconsin': 'WI',
 'Wyoming': 'WY'}

In [24]:
county_2015['State'] = county_2015['State'].map(state_abbv_dict)
county_2015.tail()

C:\Users\darre\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

      Year     Month State              County  Rate  min_wage
2797  2015  February    ME     Somerset County   8.4      7.92
2798  2015  February    ME       Oxford County   6.8      7.92
2799  2015  February    ME         Knox County   6.1      7.92
2800  2015  February    ME  Piscataquis County   7.0      7.92
2801  2015  February    ME    Aroostook County   7.2      7.92

In [26]:
pres16.rename(columns={"county": "County", "st": "State"}, inplace=True)
pres16.head()

,County,fips,cand,State,pct_report,votes,total_votes,pct,lead
0,NaN,US,Donald Trump,US,0.9951,60350241.0,127592176.0,0.472993,Donald Trump
1,NaN,US,Hillary Clinton,US,0.9951,60981118.0,127592176.0,0.477938,Donald Trump
2,NaN,US,Gary Johnson,US,0.9951,4164589.0,127592176.0,0.032640,Donald Trump
3,NaN,US,Jill Stein,US,0.9951,1255968.0,127592176.0,0.009844,Donald Trump
4,NaN,US,Evan McMullin,US,0.9951,451636.0,127592176.0,0.003540,Donald Trump

In [27]:
for df in [county_2015, pres16]:
    df.set_index(["County", "State"], inplace=True)

pres16 = pres16[pres16['cand']=="Donald Trump"]
pres16 = pres16[['pct']]
pres16.dropna(inplace=True)
pres16.head(2)

                   pct
County State
NaN    US     0.472993
       CA     0.330641

In [28]:
county_2015.head(2)

                     Year     Month  Rate  min_wage
County        State
Newton County MS     2015  February   6.1       0.0
Panola County MS     2015  February   9.4       0.0

In [29]:
all_together = county_2015.merge(pres16, on=["County", "State"])
all_together.dropna(inplace=True)
all_together.drop("Year", axis=1, inplace=True)
all_together.head()

                        Month  Rate  min_wage       pct
County        State
Newton County MS     February   6.1       0.0  0.689900
Panola County MS     February   9.4       0.0  0.496230
Monroe County MS     February   7.9       0.0  0.640454
Hinds County  MS     February   6.1       0.0  0.272232
Kemper County MS     February  10.6       0.0  0.383272

In [30]:
all_together.corr()

              Rate  min_wage       pct
Rate      1.000000 -0.143714 -0.195986
min_wage -0.143714  1.000000 -0.076527
pct      -0.195986 -0.076527  1.000000

In [31]:
all_together.cov()

              Rate  min_wage       pct
Rate      5.362972 -0.952042 -0.070181
min_wage -0.952042  8.182986 -0.033850
pct      -0.070181 -0.033850  0.023910